/************************文件说明*****************************************************
* Copyright (c) 2019 ,杭州广安汽车电器有限公司  All rights reserved.
*
* 文件名称：CANIDConfig.h
* 功能描述：CANID 配置
* 1  诊断ID,发送ID ,接收ID 
* 2  发送IF id 定义
* 编译器： codewarrior IDE 11.1
* MCU说明：此模块为上层应用，和MCU 无关
* 更改说明： 文件按照规范更改
* 此文件由PC 自动生成，PC 版本 V1.0, DBC 文件名：  
* 生成日期：  
*/
/**************************更改记录******************************************************
 * 
* 版本：1.0
* 说明：初始版本建立
* 原作者：xb
* 完成日期：2019年7月22日

* 版本：1.1
* 说明：增加autosar
* 原作者：xb
* 完成日期：2019年10月23日
* 
* 版本：1.2
* 说明： CAN_STANDARD_ 的宏定义在此处设置， CANDrive.H 文件中这个宏定义屏蔽 
* 作者：XB
* 完成日期：2020年7月7日

* 版本：1.2
* 说明：此文件的CAN 滤波掩码，建议工程师重新定义 
* 作者：
* 完成日期：
*/

#ifndef CANIDCONFIG_H_
#define CANIDCONFIG_H_


